# ImageInstanceId Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ImageView..::..ImageInstanceId Property
ImageView Class See Also
---
Id of the image in the view.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ElementId ImageInstanceId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ImageInstanceId As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ ImageInstanceId {
	ElementId^ get ();
}
```

# See Also
ImageView Class
Autodesk.Revit.DB Namespace